In [1]:
##pandas for analysing and processing structured data [databases,excel]
# pandas provides two data structures namely data frame and series 
import pandas as pd
import numpy as np

In [2]:
#dataframe is a table that stores data

In [3]:
dict1 = {"name":["harry","rohan","skillf","shubh"],
         "marks":[92,34,24,17],
         "city":["rampur","kolkata","bareilly","antactica"]
         
        }

In [4]:
df = pd.DataFrame(dict1) #convert into excel

In [5]:
df #0 ,1,2 are indexes and can be changed

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antactica

In [6]:
df.to_csv('friends2',index=False) # conversts to excel and stoes in laptop

In [7]:
df.tail()

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antactica

In [8]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [9]:
df1 =pd.read_excel(r"C:\Users\prabh\OneDrive\Desktop\Book1.xlsx")

In [17]:
x,y = df.shape
print(x,y)

4 3

In [10]:
df1

   1      7777
0     2   yyyy
1     4     7u
2     5     78
3     6     78
4   666  66666

In [13]:
#accessing some columns 
somecol = df1[7777]

In [14]:
somecol

0     yyyy
1       7u
2       78
3       78
4    66666
Name: 7777, dtype: object

In [15]:
# accesing some rows
somerows = df1[1:3]

In [16]:
somerows

   1    7777
1     4   7u
2     5   78

In [21]:
#accessing some rows and columns can be done in two different methods 
firstrows = df1[0:2][1]
firstcols = df1[1][0:2] #equivalent

In [22]:
firstrows

0    2
1    4
Name: 1, dtype: int64

firstcols

In [23]:
print(firstcols)

0    2
1    4
Name: 1, dtype: int64

In [24]:
#iloc function to access some columns 
df1.iloc[0:2,0:1]

   1
0  2
1  4

In [27]:
#list can also be passed in this 
df1.iloc[:2,[0,1]]

   1     7777
0     2  yyyy
1     4    7u

In [30]:
# iloc function for getting a single row 
df2=df1.iloc[1]

In [31]:
type(df2)# getting a single column by iloc method gives you a series rather than a dataframe

pandas.core.series.Series

In [33]:
df3 = df1.iloc[:,0:1]

In [34]:
df3

     1
0    2
1    4
2    5
3    6
4  666

In [35]:
print(type(df3)) # note that this method provides you a data frame

<class 'pandas.core.frame.DataFrame'>

In [36]:
#conditional acces of data 
# lets use dataset df from now 
df

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antactica

In [37]:
df[df.marks==17]

    name  marks       city
3  shubh     17  antactica

In [39]:
df[df.marks>=30]

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [40]:
# and operator 
df[(df.marks>30) & (df.city=="rampur")]

    name  marks    city
0  harry     92  rampur

In [43]:
#or operator
df[(df.marks>30) | (df.city=="antactica")]

    name  marks       city
0  harry     92     rampur
1  rohan     34    kolkata
3  shubh     17  antactica

In [44]:
# adding and deleting columns 
df.size

12

In [45]:
df.shape

(4, 3)

In [46]:
df['num']=[98,67,89,56]

In [47]:
df

     name  marks       city  num
0   harry     92     rampur   98
1   rohan     34    kolkata   67
2  skillf     24   bareilly   89
3   shubh     17  antactica   56

In [48]:
#using exissting columns to generate new column 
df['percentage'] = df.num/df.marks

In [51]:
df

     name  marks       city  num  percentage
0   harry     92     rampur   98    1.065217
1   rohan     34    kolkata   67    1.970588
2  skillf     24   bareilly   89    3.708333
3   shubh     17  antactica   56    3.294118

In [52]:
# for deleting a column or a complete row we use drop and axis 
# also the drop command returns a new dataframe rather than changing the existing dataframe 
# how ever if we use inplace = True then the changes are made in existing df
df.drop(['percentage'], axis=1,inplace = True)

In [53]:
df

     name  marks       city  num
0   harry     92     rampur   98
1   rohan     34    kolkata   67
2  skillf     24   bareilly   89
3   shubh     17  antactica   56

In [55]:
df.drop([1],axis=0,inplace=True)

In [56]:
df

     name  marks       city  num
0   harry     92     rampur   98
2  skillf     24   bareilly   89
3   shubh     17  antactica   56

In [57]:
df.reset_index() # for reindexing

   index    name  marks       city  num
0      0   harry     92     rampur   98
1      2  skillf     24   bareilly   89
2      3   shubh     17  antactica   56

In [66]:
# dealing with null values 
# creating null values 
df['grade']=[10,np.nan , 23]

In [67]:
df.isnull().sum()

name     0
marks    0
city     0
num      0
grade    1
dtype: int64

In [68]:
df[df.isnull().any(axis=1)]

     name  marks      city  num  grade
2  skillf     24  bareilly   89    NaN

In [69]:
df=df.dropna()

In [70]:
df

    name  marks       city  num  grade
0  harry     92     rampur   98   10.0
3  shubh     17  antactica   56   23.0

In [72]:
df.reset_index()

   index   name  marks       city  num  grade
0      0  harry     92     rampur   98   10.0
1      3  shubh     17  antactica   56   23.0

In [73]:
#unique() is used to print unique values in a column
# value_counts() for number of reccurence o0f each value 
#valuecounts(normalize = true) is used for printing fraction wrt total 
#.sum() for sum of all values
#.mean()

In [74]:
df.to_csv('new.csv') # will save the file to disk